<template>
    <div class="rating-page">
        <h2 class="rating-page-title">Рейтинг контента</h2>
        <p class="rating-page-description">
            GIF-файлы предназначены для
            всех, и GIPHY стремится сделать так, чтобы поиск GIF-файлов был положительным опытом для всех. Мы
            относимся к безопасности контента крайне серьезно. Наша библиотека GIF-файлов и наклеек тщательно
            модерируется и организована по рейтингу, чтобы предоставить пользователям GIPHY максимально безопасный
            поиск. Мы без колебаний удаляем контент, который не соответствует нашим Правилам
            сообщества.
        </p>
        <h6 class="rating-levels-text">
            Уровни рейтинга контента
        </h6>
        <div class="rating-wrapper">
            <div class="rating-logo">
                <div class="rating-logo-content">
                    <h1 class="rating-age">0+</h1>
                    <h5 class="rating-level">Уровень 1</h5>
                </div>
            </div>
            <div class="rating-content">
                <h6 class="rating-content-title">
                    Содержит изображения, которые широко принимаются как уместные и часто встречаются в общественных местах.
                </h6>
                <div class="rating-content-text">
                    🚫 Никакой ненормативной лексики <br>
                    🚫 Никакого сексуального контента — реального или анимированного (никаких намёков или частичной
                    наготы, ничего провокационного) <br>
                    🚫 Никакого насилия или угрожающих изображений <br>
                    🚫 Никакого оружия (исключения — палец, вода и пистолеты Nerf) <br>
                    🚫 Никаких веществ/наркотиков
                </div>
            </div>
        </div>
        <div class="rating-divider" />
        <div class="rating-wrapper">
            <div class="rating-logo">
                <div class="rating-logo-content">
                    <h1 class="rating-age">16+</h1>
                    <h5 class="rating-level">Уровень 2</h5>
                </div>
            </div>
            <div class="rating-content">
                <h6 class="rating-content-title">
                    Содержит изображения, которые часто можно увидеть в общественных местах, но которые 
                    не получили должного признания.
                </h6>
                <ul class="rating-content-list">
                    <li>Умеренная ненормативная лексика (например: задница, черт, чёрт, отстой и т. д.)</li>
                    <li>Легкий юмор в туалете</li>
                    <li>
                        Умеренный сексуальный контент (например, поцелуи в губы, провокационные движения тела в
                        полностью одетом виде).
                    </li>
                    <li>
                        Умеренное насилие (гневные крики, разбивание неодушевленных предметов, неудачи, шутливые
                        упоминания актов насилия и т. д.)
                    </li>
                    <li>
                        Изображения, на которых изображены настоящие пистолеты в кобурах и люди, целящиеся или
                        стреляющие из нереалистично выглядящего оружия из поп-культуры.
                    </li>
                    <li>Изображения средневекового оружия без крови и легкие поединки без травм</li>
                    <li>
                        Слегка ненормальные или пугающие действия, движения или жесты (например, жуткие кадры из
                        фильмов ужасов без крови, ужасный грим и т. д.)
                    </li>
                    <li>
                        Изображения табака и алкоголя, их торговых марок и умеренного употребления
                        (например, потягивание, крики «ура», держание сигарет и т. д.)
                    </li>
                </ul>
            </div>
        </div>
        <div class="rating-divider" />
        <div class="rating-wrapper">
            <div class="rating-logo">
                <div class="rating-logo-content">
                    <h1 class="rating-age">18+</h1>
                    <h5 class="rating-level">Уровень 3</h5>
                </div>
            </div>
            <div class="rating-content">
                <h6 class="rating-content-title">
                    Содержит изображения, которые обычно не видны, если их специально не искать, но которые тем 
                    не менее часто встречаются свидетелями.
                </h6>
                <ul class="rating-content-list">
                    <li>
                        Умеренное количество ненормативной лексики и подразумеваемых сокращений
                        (например, анатомия человека, названия лекарств, что за фигня и т. д.)
                    </li>
                    <li>Использование среднего пальца как грубого жеста</li>
                    <li>
                        Сексуальный контент и темы, включая сексуальные намеки без наготы
                        (например, поцелуи, сексуально вызывающие движения, упоминания половых актов)
                    </li>
                    <li>Эксплуатация человеческого тела в частично закрытом виде</li>
                    <li>Изображения, демонстрирующие не фонтанирующую кровь в контексте насилия</li>
                    <li>
                        Умеренно агрессивное или угрожающее поведение или жесты
                        (например: указание ножом, отрывки из фильмов ужасов, нокауты, травмы)
                    </li>
                    <li>Реалистичное оружие (например, оружие, которое держат в руках, направляют на него, стреляют и т. д.)</li>
                    <li>
                        Злоупотребление алкоголем
                        (например, распитие спиртного залпом, поддержание температуры в бочках, распитие пива и т. д.)
                    </li>
                    <li>Упоминания марихуаны, употребления запрещенных наркотиков и вымышленные изображения употребления</li>
                    <li>Оспаривание религии или религиозных деятелей</li>
                </ul>
            </div>
        </div>
        <div class="rating-divider" />
        <div class="rating-wrapper">
            <div class="rating-logo">
                <div class="rating-logo-content">
                    <h1 class="rating-age">21+</h1>
                    <h5 class="rating-level">Уровень 4</h5>
                </div>
            </div>
            <div class="rating-content">
                <h6 class="rating-content-title">
                    Содержит изображения, которые обычно не видны, если их не искать,
                    и которые могут считаться тревожными, если их увидеть.
                </h6>
                <ul class="rating-content-list">
                    <li>Грубая ненормативная лексика</li>
                    <li>
                        Непорнографические изображения с ярко выраженной сексуальной тематикой и намёками,
                        очень откровенная одежда, основной акцент на телах
                        и иные возбуждающие изображения с частичной наготой.
                    </li>
                    <li>
                        Грубо нарисованные или юмористические карикатуры или компьютерная графика,
                        изображающая гениталии
                    </li>
                    <li>
                        Образы и контент из фильмов, телепередач и видеоигр,
                        которые являются крайне тревожными, пугающими, удручающими
                        или мрачными, даже если в них нет сцен насилия
                    </li>
                    <li>Любая имитация насилия с кровью</li>
                    <li>Интенсивное употребление запрещенных наркотиков в вымышленной обстановке</li>
                    <li>Очень грубый и вульгарный юмор</li>
                </ul>
            </div>
        </div>
</div>
</template>

<script setup lang="ts">

</script>

<style scoped>
@import url("~/assets/css/rating.scss");
</style>